html/geekbang-mysql-practice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head><!-- Global site tag (gtag.js) - Google Analytics --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>极客时间|MySQL实战45讲 文章目录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="work" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="content">
<h1 class="title">极客时间|MySQL实战45讲 文章目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdfc8f0d">开篇词 | 这一次，让我们一起来搞懂MySQL</a></li>
<li><a href="#orgfd52dac">01 | 基础架构：一条SQL查询语句是如何执行的？</a></li>
<li><a href="#org8e1b0f6">02  | 日志系统：一条SQL更新语句是如何执行的？</a></li>
<li><a href="#org89964fd">03 | 事务隔离：为什么你改了我还看不见？</a></li>
<li><a href="#orgb686290">04 | 深入浅出索引（上）</a></li>
<li><a href="#org6c86068">05 | 深入浅出索引（下）</a></li>
<li><a href="#orgc405f7d">06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？</a></li>
<li><a href="#org223f77a">07 | 行锁功过：怎么减少行锁对性能的影响？</a></li>
<li><a href="#orge801ae4">08 | 事务到底是隔离的还是不隔离的？</a></li>
<li><a href="#orge4f962a">09 | 普通索引和唯一索引，应该怎么选择？</a></li>
<li><a href="#org6d0a49b">10 | MySQL为什么有时候会选错索引？</a></li>
<li><a href="#org7e653ae">11 |  怎么给字符串字段加索引？</a></li>
<li><a href="#org41799ed">12 | 为什么我的MySQL会“抖”一下？</a></li>
<li><a href="#org755f588">13 | 为什么表数据删掉一半，表文件大小不变？</a></li>
<li><a href="#orgfd25578">14 | count(*)这么慢，我该怎么办？</a></li>
<li><a href="#orgc4dc6ac">15 | 答疑文章（一）：日志和索引相关问题</a></li>
<li><a href="#orgc2d6503">直播回顾 | 林晓斌：我的 MySQL 心路历程</a></li>
<li><a href="#org7c4d3e0">16 | “order by”是怎么工作的？</a></li>
<li><a href="#org5873d3e">17 | 如何正确地显示随机消息？</a></li>
<li><a href="#org71d6d4e">18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgdfc8f0d" class="outline-2">
<h2 id="orgdfc8f0d"><a href="https://time.geekbang.org/column/article/67888">开篇词 | 这一次，让我们一起来搞懂MySQL</a></h2>
<div class="outline-text-2" id="text-orgdfc8f0d">
<p>
我希望这个专栏能够激发开发者对数据库原理的探索欲，从而更好地理解工作中遇到的问题，更能知道背后的为什么。
</p>
</div>
</div>


<div id="outline-container-orgfd52dac" class="outline-2">
<h2 id="orgfd52dac"><a href="https://time.geekbang.org/column/article/68319">01 | 基础架构：一条SQL查询语句是如何执行的？</a></h2>
<div class="outline-text-2" id="text-orgfd52dac">
<p>
今天我给你介绍了MySQL的逻辑架构，希望你对一个SQL语句完整执行流程的各个阶段能有一个初步的印象。
</p>
</div>
</div>


<div id="outline-container-org8e1b0f6" class="outline-2">
<h2 id="org8e1b0f6"><a href="https://time.geekbang.org/column/article/68633">02  | 日志系统：一条SQL更新语句是如何执行的？</a></h2>
<div class="outline-text-2" id="text-org8e1b0f6">
<p>
今天这篇文章，主要介绍了MySQL里面最重要的两个日志，即物理日志redo log和逻辑日志binlog。
</p>
</div>
</div>


<div id="outline-container-org89964fd" class="outline-2">
<h2 id="org89964fd"><a href="https://time.geekbang.org/column/article/68963">03 | 事务隔离：为什么你改了我还看不见？</a></h2>
<div class="outline-text-2" id="text-org89964fd">
<p>
我介绍了MySQL的事务隔离级别的现象和实现，根据实现原理分析了长事务存在的风险，以及如何用正确的方式避免长&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb686290" class="outline-2">
<h2 id="orgb686290"><a href="https://time.geekbang.org/column/article/69236">04 | 深入浅出索引（上）</a></h2>
<div class="outline-text-2" id="text-orgb686290">
<p>
今天这篇文章，介绍了引擎的数据结构模型，帮助你理解MySQL为什么选择B+树结构来存储数据。同时，这篇文章还&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6c86068" class="outline-2">
<h2 id="org6c86068"><a href="https://time.geekbang.org/column/article/69636">05 | 深入浅出索引（下）</a></h2>
<div class="outline-text-2" id="text-org6c86068">
<p>
在满足语句需求的情况下， 尽量少地访问资源是数据库设计的重要原则之一。我们在使用数据库的时候，尤其是在设&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc405f7d" class="outline-2">
<h2 id="orgc405f7d"><a href="https://time.geekbang.org/column/article/69862">06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？</a></h2>
<div class="outline-text-2" id="text-orgc405f7d">
<p>
今天，我跟你介绍了MySQL的全局锁和表级锁。
</p>
</div>
</div>


<div id="outline-container-org223f77a" class="outline-2">
<h2 id="org223f77a"><a href="https://time.geekbang.org/column/article/70215">07 | 行锁功过：怎么减少行锁对性能的影响？</a></h2>
<div class="outline-text-2" id="text-org223f77a">
<p>
今天，我和你介绍了MySQL的行锁，涉及了两阶段所协议、死锁和死锁检测这两大部分内容。
</p>
</div>
</div>


<div id="outline-container-orge801ae4" class="outline-2">
<h2 id="orge801ae4"><a href="https://time.geekbang.org/column/article/70562">08 | 事务到底是隔离的还是不隔离的？</a></h2>
<div class="outline-text-2" id="text-orge801ae4">
<p>
普通查询语句是一致性读，一致性读会根据row trx<sub>id和up</sub><sub>limit</sub><sub>id的大小决定数据版本的可见性</sub>。
</p>
</div>
</div>


<div id="outline-container-orge4f962a" class="outline-2">
<h2 id="orge4f962a"><a href="https://time.geekbang.org/column/article/70848">09 | 普通索引和唯一索引，应该怎么选择？</a></h2>
<div class="outline-text-2" id="text-orge4f962a">
<p>
我从普通索引和唯一索引的选择开始，和你分享了数据的查询和更新过程，然后说明了change buffer的机制以及应用&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6d0a49b" class="outline-2">
<h2 id="org6d0a49b"><a href="https://time.geekbang.org/column/article/71173">10 | MySQL为什么有时候会选错索引？</a></h2>
<div class="outline-text-2" id="text-org6d0a49b">
<p>
今天，我要和你聊聊索引统计的更新机制，以及优化器选错索引了应该如何处理。
</p>
</div>
</div>


<div id="outline-container-org7e653ae" class="outline-2">
<h2 id="org7e653ae"><a href="https://time.geekbang.org/column/article/71492">11 |  怎么给字符串字段加索引？</a></h2>
<div class="outline-text-2" id="text-org7e653ae">
<p>
在今天这篇文章中，我跟你聊了聊字符串字段创建索引的场景。
</p>
</div>
</div>


<div id="outline-container-org41799ed" class="outline-2">
<h2 id="org41799ed"><a href="https://time.geekbang.org/column/article/71806">12 | 为什么我的MySQL会“抖”一下？</a></h2>
<div class="outline-text-2" id="text-org41799ed">
<p>
我延续第2篇中介绍的WAL的概念，和你解释了这个机制后续需要的刷脏页操作和执行时机。利用WAL技术，数据库将随&#x2026;
</p>
</div>
</div>


<div id="outline-container-org755f588" class="outline-2">
<h2 id="org755f588"><a href="https://time.geekbang.org/column/article/72388">13 | 为什么表数据删掉一半，表文件大小不变？</a></h2>
<div class="outline-text-2" id="text-org755f588">
<p>
今天这篇文章，我和你讨论了数据库中回收表空间的方法。
</p>
</div>
</div>


<div id="outline-container-orgfd25578" class="outline-2">
<h2 id="orgfd25578"><a href="https://time.geekbang.org/column/article/72775">14 | count(*)这么慢，我该怎么办？</a></h2>
<div class="outline-text-2" id="text-orgfd25578">
<p>
今天，我和你聊了聊MySQL中获得表行数的几种方法。
</p>
</div>
</div>


<div id="outline-container-orgc4dc6ac" class="outline-2">
<h2 id="orgc4dc6ac"><a href="https://time.geekbang.org/column/article/73161">15 | 答疑文章（一）：日志和索引相关问题</a></h2>
<div class="outline-text-2" id="text-orgc4dc6ac">
<p>
我针对前14篇文章，大家在评论区中的留言，从中摘取了关于日志和索引的相关问题，串成了今天这篇文章。
</p>
</div>
</div>


<div id="outline-container-orgc2d6503" class="outline-2">
<h2 id="orgc2d6503"><a href="https://time.geekbang.org/column/article/73370">直播回顾 | 林晓斌：我的 MySQL 心路历程</a></h2>
<div class="outline-text-2" id="text-orgc2d6503">
<p>
在专栏上线后的11月21日，我来到极客时间做了一场主题是“我的MySQL心路历程”的直播。今天，我特意将这个直播&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7c4d3e0" class="outline-2">
<h2 id="org7c4d3e0"><a href="https://time.geekbang.org/column/article/73479">16 | “order by”是怎么工作的？</a></h2>
<div class="outline-text-2" id="text-org7c4d3e0">
<p>
今天这篇文章，我和你介绍了MySQL里面order by语句的几种算法流程。
</p>
</div>
</div>


<div id="outline-container-org5873d3e" class="outline-2">
<h2 id="org5873d3e"><a href="https://time.geekbang.org/column/article/73795">17 | 如何正确地显示随机消息？</a></h2>
<div class="outline-text-2" id="text-org5873d3e">
<p>
今天这篇文章，我是借着随机排序的需求，跟你介绍了MySQL对临时表排序的执行过程。
</p>
</div>
</div>


<div id="outline-container-org71d6d4e" class="outline-2">
<h2 id="org71d6d4e"><a href="https://time.geekbang.org/column/article/74059">18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？</a></h2>
<div class="outline-text-2" id="text-org71d6d4e">
<p>
今天我给你举了三个例子，其实是在说同一件事儿，即：对索引字段做函数操作，可能会破坏索引值的有序性，因此优&#x2026;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: work</p>
<p class="date">Created: 2019-04-03 Wed 04:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
<div id="content"><!-- DISQUS BEGIN --><div id="disqus_thread"></div><script>/***  RECOMMENDED CONFIGURATION VARIABLES: EDIT AND UNCOMMENT THE SECTION BELOW TO INSERT DYNAMIC VALUES FROM YOUR PLATFORM OR CMS.*  LEARN WHY DEFINING THESE VARIABLES IS IMPORTANT: https://disqus.com/admin/universalcode/#configuration-variables*/var disqus_config = function () {this.page.url = 'https://maypeppa.github.io/html/geekbang-mysql-practice.html';this.page.identifier = 'geekbang-mysql-practice.html';};(function() {var d = document, s = d.createElement('script');s.src = 'https://cdnjs.cloudflare.com/ajax/libs/embed-js/4.2.1/embed.min.js';s.setAttribute('data-timestamp', +new Date());(d.head || d.body).appendChild(s);})();</script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><!-- DISQUS END --></div></body>
</html>
